name: "tensorrt_llm"
backend: "tensorrtllm"
max_batch_size: 8
model_transaction_policy {
  decoupled: true
}
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
parameters: {
  key: "executor_worker_path"
  value: { string_value: "trtllmExecutorWorker" }
}
parameters: {
  key: "tokenizer_dir"
  value: { string_value: "${MODEL_DIR}/1/tokenizer" }
}
