name: "ensemble_onnx"
platform: "ensemble"
max_batch_size: 8
input [
  { name: "RAW_TEXT" data_type: TYPE_STRING dims: [ 1 ] }
]
output [
  { name: "FINAL_TEXT" data_type: TYPE_STRING dims: [ 1 ] }
]
ensemble_scheduling {
  step [
    {
      model_name: "py_preprocess"
      input_map { key: "RAW_TEXT" value: "RAW_TEXT" }
      output_map { key: "INPUT0" value: "PREPROCESSED" }
    },
    {
      model_name: "onnx_identity"
      input_map { key: "INPUT0" value: "PREPROCESSED" }
      output_map { key: "OUTPUT0" value: "RAW_OUT" }
    },
    {
      model_name: "py_postprocess"
      input_map { key: "OUTPUT0" value: "RAW_OUT" }
      output_map { key: "FINAL_TEXT" value: "FINAL_TEXT" }
    }
  ]
}
