name: "trtllm_model"
backend: "tensorrtllm"
max_batch_size: 8
input [
  { name: "text_input" data_type: TYPE_STRING dims: [ 1 ] }
]
output [
  { name: "text_output" data_type: TYPE_STRING dims: [ 1 ] }
]
parameters: { key: "engine_dir" value: { string_value: "/models/trtllm_model/1/engine" } }
