name: "ensemble"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "PROMPT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "GENERATED_TEXT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "tensorrt_llm"
      model_version: -1
      input_map {
        key: "text_input"
        value: "PROMPT"
      }
      output_map {
        key: "text_output"
        value: "GENERATED_TEXT"
      }
    }
  ]
}
