name: "ensemble_vllm"
platform: "ensemble"
max_batch_size: 8
input [
  { name: "RAW_TEXT" data_type: TYPE_STRING dims: [ 1 ] }
]
output [
  { name: "FINAL_TEXT" data_type: TYPE_STRING dims: [ 1 ] }
]
ensemble_scheduling {
  step [
    {
      model_name: "vllm_model"
      input_map { key: "text_input" value: "RAW_TEXT" }
      output_map { key: "text_output" value: "FINAL_TEXT" }
    }
  ]
}
