name: "resnet50_savedmodel"
backend: "tensorflow"
max_batch_size: 8
input [
  {
    name: "input_tensor"
    data_type: TYPE_FP32
    dims: [ 224, 224, 3 ]
  }
]
output [
  {
    name: "predictions"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]
instance_group [
  {
    kind: KIND_GPU
  }
]
