name: "vllm_model"
backend: "vllm"
max_batch_size: 8
model_transaction_policy {
  decoupled: true
}
input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
parameters: {
  key: "model"
  value: { string_value: "meta-llama/Llama-3.1-8B-Instruct" }
}
parameters: {
  key: "tokenizer"
  value: { string_value: "${MODEL_DIR}/1/tokenizer" }
}
parameters: {
  key: "gpu_memory_utilization"
  value: { string_value: "0.9" }
}
