name: "pt_identity"
backend: "pytorch"
max_batch_size: 8
input [
  { name: "INPUT0" data_type: TYPE_FP32 dims: [ -1 ] }
]
output [
  { name: "OUTPUT0" data_type: TYPE_FP32 dims: [ -1 ] }
]
instance_group [{ kind: KIND_GPU }]
